; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-3-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-2 - location
	p0-4 - location
	p1-5 - location
	p1-7 - location
	p2-6 - location
	p3-1 - location
	p4-3 - location
	p5-3 - location
	p6-1 - location
	p7-0 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s5)
	(at driver3 s3)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s7)
	(at package2 s6)
	(at package3 s7)
	(at package4 s7)
	(at package5 s5)
	(at package6 s1)
	(at package7 s7)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 5)
	(= (time-to-walk p0-2 s0) 5)
	(= (time-to-walk s2 p0-2) 76)
	(= (time-to-walk p0-2 s2) 76)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 28)
	(= (time-to-walk p0-4 s0) 28)
	(= (time-to-walk s4 p0-4) 68)
	(= (time-to-walk p0-4 s4) 68)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 33)
	(= (time-to-walk p1-5 s1) 33)
	(= (time-to-walk s5 p1-5) 72)
	(= (time-to-walk p1-5 s5) 72)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 92)
	(= (time-to-walk p1-7 s1) 92)
	(= (time-to-walk s7 p1-7) 95)
	(= (time-to-walk p1-7 s7) 95)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 37)
	(= (time-to-walk p2-6 s2) 37)
	(= (time-to-walk s6 p2-6) 47)
	(= (time-to-walk p2-6 s6) 47)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 94)
	(= (time-to-walk p3-1 s3) 94)
	(= (time-to-walk s1 p3-1) 89)
	(= (time-to-walk p3-1 s1) 89)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 18)
	(= (time-to-walk p4-3 s4) 18)
	(= (time-to-walk s3 p4-3) 79)
	(= (time-to-walk p4-3 s3) 79)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 40)
	(= (time-to-walk p5-3 s5) 40)
	(= (time-to-walk s3 p5-3) 87)
	(= (time-to-walk p5-3 s3) 87)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 74)
	(= (time-to-walk p6-1 s6) 74)
	(= (time-to-walk s1 p6-1) 55)
	(= (time-to-walk p6-1 s1) 55)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 50)
	(= (time-to-walk p7-0 s7) 50)
	(= (time-to-walk s0 p7-0) 68)
	(= (time-to-walk p7-0 s0) 68)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 82)
	(= (time-to-drive s1 s0) 82)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 3)
	(= (time-to-drive s6 s0) 3)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 35)
	(= (time-to-drive s2 s1) 35)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 73)
	(= (time-to-drive s5 s1) 73)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 77)
	(= (time-to-drive s0 s2) 77)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 58)
	(= (time-to-drive s3 s2) 58)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 38)
	(= (time-to-drive s5 s2) 38)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 23)
	(= (time-to-drive s6 s2) 23)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 50)
	(= (time-to-drive s1 s3) 50)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 52)
	(= (time-to-drive s7 s3) 52)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 2)
	(= (time-to-drive s0 s4) 2)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 54)
	(= (time-to-drive s1 s4) 54)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 27)
	(= (time-to-drive s6 s4) 27)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 29)
	(= (time-to-drive s7 s4) 29)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 21)
	(= (time-to-drive s0 s5) 21)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 59)
	(= (time-to-drive s4 s5) 59)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 1)
	(= (time-to-drive s6 s5) 1)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 13)
	(= (time-to-drive s3 s6) 13)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 54)
	(= (time-to-drive s7 s6) 54)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 37)
	(= (time-to-drive s0 s7) 37)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 60)
	(= (time-to-drive s5 s7) 60)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s5)
	(at truck1 s3)
	(at truck3 s5)
	(at package1 s4)
	(at package2 s4)
	(at package3 s1)
	(at package4 s2)
	(at package5 s7)
	(at package6 s5)
	(at package7 s1)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (walk driver3 s3 p4-3)
   deleted: (at driver3 s3)
   added: (at driver3 p4-3)
   changed: (walked) from 0 to 79
   goals met: 1 of 11
2. (walk driver3 p4-3 s4)
   deleted: (at driver3 p4-3)
   added: (at driver3 s4)
   changed: (walked) from 79 to 97
   goals met: 1 of 11
3. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 11
4. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   changed: (walked) from 97 to 169
   goals met: 1 of 11
5. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   changed: (walked) from 169 to 202
   goals met: 2 of 11
6. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 0 to 54
   goals met: 2 of 11
7. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 2 of 11
8. (drive-truck truck1 s1 s5 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 54 to 127
   goals met: 2 of 11
9. (unload-truck package6 truck1 s5)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 3 of 11
10. (load-truck package5 truck1 s5)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 3 of 11
11. (drive-truck truck1 s5 s6 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (driven) from 127 to 128
   goals met: 3 of 11
12. (load-truck package2 truck1 s6)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   goals met: 3 of 11
13. (drive-truck truck1 s6 s4 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (driven) from 128 to 155
   goals met: 3 of 11
14. (unload-truck package2 truck1 s4)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 4 of 11
15. (drive-truck truck1 s4 s7 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   changed: (driven) from 155 to 184
   goals met: 4 of 11
16. (unload-truck package5 truck1 s7)
   deleted: (in package5 truck1)
   added: (at package5 s7)
   goals met: 5 of 11
17. (load-truck package3 truck1 s7)
   deleted: (at package3 s7)
   added: (in package3 truck1)
   goals met: 5 of 11
18. (load-truck package1 truck1 s7)
   deleted: (at package1 s7)
   added: (in package1 truck1)
   goals met: 5 of 11
19. (drive-truck truck1 s7 s4 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (driven) from 184 to 213
   goals met: 5 of 11
20. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   goals met: 6 of 11
21. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 213 to 267
   goals met: 6 of 11
22. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 7 of 11
23. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 267 to 349
   goals met: 7 of 11
24. (drive-truck truck1 s0 s7 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (driven) from 349 to 386
   goals met: 7 of 11
25. (load-truck package4 truck1 s7)
   deleted: (at package4 s7)
   added: (in package4 truck1)
   goals met: 7 of 11
26. (load-truck package7 truck1 s7)
   deleted: (at package7 s7)
   added: (in package7 truck1)
   goals met: 7 of 11
27. (drive-truck truck1 s7 s3 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s3)
   changed: (driven) from 386 to 438
   goals met: 8 of 11
28. (drive-truck truck1 s3 s1 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 438 to 488
   goals met: 7 of 11
29. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 8 of 11
30. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 488 to 523
   goals met: 8 of 11
31. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 9 of 11
32. (drive-truck truck1 s2 s3 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (driven) from 523 to 581
   goals met: 10 of 11
33. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 10 of 11
34. (walk driver3 s3 p4-3)
   deleted: (at driver3 s3)
   added: (at driver3 p4-3)
   changed: (walked) from 202 to 281
   goals met: 10 of 11
35. (walk driver3 p4-3 s4)
   deleted: (at driver3 p4-3)
   added: (at driver3 s4)
   changed: (walked) from 281 to 299
   goals met: 10 of 11
36. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 10 of 11
37. (drive-truck truck3 s4 s5 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 581 to 640
   goals met: 11 of 11
